Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class HostedWallAssociationFailures
Public NotInheritable Class HostedWallAssociationFailures
public ref class HostedWallAssociationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HostedWallAssociationFailures = class end
The BuiltInFailures.HostedWallAssociationFailures type exposes the following members.
Properties
Name | Description
AssociationFailed |  Associate hosted wall to host failed.
AssocToHostFailed |  Failed to pick the target wall as host wall.
CantAssociateWithHostError |  The host and the hosted element are misaligned. Possible issues include non-parallel alignment, overlapping geometry, or the offset value being beyond the accepted range.
PinnedElemCannotInteractWarn |  The selected wall is pinned and cannot interact with the target host.
UnqualifiedWallTypeError |  Stacked walls and curtain walls cannot maintain hosted relationships with other walls.
UnqualifiedWallWarn |  Unable to create one or multiple walls as hosted walls on the target host elements.
Top
See Also
Reference
Autodesk.Revit.DB Namespace